SyncAdapterServiceExample/Doc/СоцЗащита/Подсистема синхронизации/Контрольные примеры/ToReestrMSP_fromMSR_CatalogItemsRequest.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:tem="http://tempuri.org/" xmlns:iis="http://schemas.datacontract.org/2004/07/IIS.Persona.ServiceBus.Objects" xmlns:arr="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
<soap:Header/>
<soap:Body>
<tem:SendMessageToESB>
<tem:message>
<iis:Body>
<![CDATA[
<?xml version="1.0" encoding="UTF-8"?>
<catalogsItemsRequestFromMsrToReestrMsp xmlns="http://schemas.datacontract.org/2004/07/ConsoleApp1" xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
   <RequestInfo>Request info</RequestInfo>
   <criteria>FakeCriteria</criteria>
   <idCatalog>1403</idCatalog>
   <sorting>
      <sortingDef>
         <sortOrder>1</sortOrder>
         <sortType>Asc</sortType>
         <tehName>Sort1</tehName>
      </sortingDef>
      <sortingDef>
         <sortOrder>2</sortOrder>
         <sortType>Desc</sortType>
         <tehName>Sort2</tehName>
      </sortingDef>
   </sorting>
</catalogsItemsRequestFromMsrToReestrMsp>
]]>
</iis:Body>
<iis:ClientID>MSR</iis:ClientID>
<iis:MessageTypeID>ToReestrMSP_fromMSR_CatalogItemsRequest</iis:MessageTypeID>
<iis:Priority>3</iis:Priority>
</tem:message>
</tem:SendMessageToESB>
</soap:Body>
</soap:Envelope>